Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mozi__mozi-007-threefold-argument__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 程繁問於子墨子曰：「夫子曰『聖王不爲樂』，昔諸侯倦於聽治，息於鐘鼓之樂；士大夫倦於聽治，息於竽瑟之樂；農夫春耕夏耘，秋斂冬藏，息於聆缶之樂。
en: Ch’eng Fan asked Motse: " Sir, you say the sage-kings did not have music. But, anciently, when the feudal lords were tired of attending to government, they found recreation in music of bells and drums. When the ministers and gentle-men were tired of attending to office they found recreation in music of Yu and she.

source: 今夫子曰『聖王不爲樂』，此譬之猶馬駕而不稅，弓張而不弛，無乃非有血氣者之所能至邪？」子墨子曰：「昔者堯舜有茅茨者，且以爲禮，且以爲樂。
en: And the farmers ploughed the fields in spring, weeded them in summer, reaped the harvest in autumn, and stored the grains in winter. Then they would enjoy music of jars and vases.

source: 湯放桀於大水，環天下自立以爲王，事成功立，無大後患，因先王之樂，又自作樂，命曰《護》，又修《九招》。武王勝殷殺紂，環天下自立以爲王，事成功立，無大後患，因先王之樂，又自作樂，命曰《象》。周成王因先王之樂，又自作樂，命曰《騶虞》。
en: Sir, you say the sage-kings did not have music. This would be comparing them to the horse placed under yoke and never released, and the bow drawn and never unstrung. Is this not impossible for the ordinary human being? Motse replied; In ancient times, Yao and Shun lived in huts and yet they made codes of propriety and composed music. T’ang sent Chieh to exile on the ocean and installed himself ruler of the empire. Having achieved success and without cause for anxiety, he added to the music of the former and; also institute the " Chin Chao".

source: 周成王之治天下也，不若武王。武王之治天下也，不若成湯。
en: King Wu conquered the Yin dynasty and executed Chow and installed himself ruler of the empire.

source: 成湯之治天下也，不若堯舜。故其樂逾繁者，其治逾寡。自此觀之，樂非所以治天下也。」程繁曰：「子曰『聖王無樂』，此亦樂已，若之何其謂聖王無樂也？
en: Having achieved success and having no cause of anxiety, he added to the music of the former kings that of Ms own composition, called " Hsiang King Ch’eng of Chou again added to the music of the former kings that of his own composition, named " Tsou Yii The reign of King Ch’eng was not so good as that of Bang Wu, that of King Wu was not so good as that of T’ang the Successful, and that of Tang the Successful was not so good as that of Yao and Shun, So, then, he who has the more elaborate music has the less efficient government. Judging from this, music is not anything to govern the empire with. Ch’eng Fan objected: Sir, you have said the sage-kings did not have music. This shows they did. How then can you say the sage-kings did not have music?

source: 」子墨子曰：「聖王之命也，多寡之。食之利也，以知饑而食之者智也，因爲無智矣。今聖有樂而少，此亦無也。」
en: " Motse said; The desire of the sage-kings was to cut down excesses. Eating is of course profitable, but it takes so little intelligence to eat when one is hungry that it may be said to be nil. Now the sage-kings had music, but it was so little that it may also be said to be nil.
